app/Controllers/AdminController.php

    public function dataobat(): string
    {
        $obatModel = new ObatModel();
        $data['obat'] = $obatModel->findAll();
---
SELECT *
FROM `obat`