app/Controllers/ApotekerController.php

SELECT *
FROM `chat`
WHERE   (
`sender_role` = 'user'
AND `sender_id` = '50'
 )
OR `sender_role` = 'apoteker'
ORDER BY `created_at` ASC
---
public function getChatByUser($userId)
{
    $chatModel = new ChatModel();

    // Ambil semua chat yang melibatkan user ini
    $chats = $chatModel
        ->groupStart()
            ->where('sender_role', 'user')
            ->where('sender_id', $userId)
        ->groupEnd()
        ->orWhere('sender_role', 'apoteker')
        ->orderBy('created_at', 'ASC')
        ->findAll();