app/Controllers/Home.php

    public function resetPassword($token = null)
    {
        if (!$token) {
            return redirect()->to('login')->with('error', 'Token tidak valid');
        }

        // Cek token di database
        $user = $this->userModel->where('reset_token', $token)
            ->where('reset_token_expire >', date('Y-m-d H:i:s'))
            ->first();
---
SELECT *
FROM `users`
WHERE `reset_token` = 'd1058ad7eeed75044c0143fe25f41472471a001888505152393a216afcd6fc80'
AND `reset_token_expire` > '2025-06-17 22:29:16'
 LIMIT 1