app/Controllers/KeranjangController.php

SELECT `keranjang`.`id`, `keranjang`.`jumlah`, `obat`.`nama_obat`, `obat`.`gambar_obat`, `obat`.`harga_satuan`, `obat`.`deskripsi`, `obat`.`stok`
FROM `keranjang`
JOIN `obat` ON `obat`.`id_obat` = `keranjang`.`id_obat`
SELECT *
FROM `obat`
---
    public function index()
    {
        $db = \Config\Database::connect();

        // Ambil data keranjang dan obat
        $keranjang = $db->table('keranjang')
            ->select('keranjang.id, keranjang.jumlah, obat.nama_obat, obat.gambar_obat, obat.harga_satuan, obat.deskripsi, obat.stok')
            ->join('obat', 'obat.id_obat = keranjang.id_obat')
            ->get()
            ->getResultArray();

        $subtotal = 0;
        foreach ($keranjang as $item) {
            $subtotal += $item['harga_satuan'] * $item['jumlah'];
        }

        // Ambil daftar obat (untuk select input)
        $obatModel = new \App\Models\ObatModel();
        $daftar_obat = $obatModel->findAll();

SELECT *
FROM `keranjang`
WHERE `keranjang`.`id` = '58'
---
 public function updateQuantity()
{
    // Pastikan request adalah POST dan AJAX
    if (!$this->request->isAJAX() || !$this->request->is('post')) {
        return $this->response->setJSON([
            'success' => false,
            'message' => 'Invalid request'
        ]);
    }

    $id = $this->request->getPost('id');
    $jumlah = (int)$this->request->getPost('jumlah');

    // Validasi input
    if (!$id || $jumlah < 1 || $jumlah > 99999) {
        return $this->response->setJSON([
            'success' => false,
            'message' => 'ID atau jumlah tidak valid (1-99999)'
        ]);
    }

    $keranjangModel = new KeranjangModel();
    $obatModel = new ObatModel();

    // Ambil data keranjang saat ini
    $keranjang = $keranjangModel->find($id);

SELECT *
FROM `obat`
WHERE `obat`.`id_obat` = '20'
---
    }

    // Ambil data obat
    $obat = $obatModel->find($keranjang['id_obat']);

UPDATE `keranjang` SET `jumlah` = 50
WHERE `keranjang`.`id` IN ('58')
UPDATE `obat` SET `stok` = 20
WHERE `obat`.`id_obat` IN ('20')
---

    try {
        // Update quantity di keranjang
        $keranjangModel->update($id, ['jumlah' => $jumlah]);

        // Update stok obat (kurangi stok jika quantity bertambah, tambah jika berkurang)
        $stok_baru = $obat['stok'] - $selisih;
        $obatModel->update($obat['id_obat'], ['stok' => $stok_baru]);

SELECT `keranjang`.`jumlah`, `obat`.`harga_satuan`
FROM `keranjang`
JOIN `obat` ON `obat`.`id_obat` = `keranjang`.`id_obat`
---
private function hitungSubtotal()
{
    $db = \Config\Database::connect();
    $keranjang = $db->table('keranjang')
        ->select('keranjang.jumlah, obat.harga_satuan')
        ->join('obat', 'obat.id_obat = keranjang.id_obat')
        ->get()
        ->getResultArray();