app/Controllers/UserController.php

    public function katalog(): string
    {
        $data['obat'] = $this->obatModel->findAll();
---
SELECT *
FROM `obat`

    public function profil()
{
    $userModel = new UserModel();
    $userId = session()->get('id');

    // Ambil satu user berdasarkan ID
    $data['user'] = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '35'

public function riwayat()
{
    $userId = session()->get('id');
    $transaksiModel = new TransaksiModel();

    // Ambil transaksi milik user ini
    $data['riwayat'] = $transaksiModel
                        ->where('id_user', $userId)
                        ->orderBy('tanggal_transaksi', 'DESC')
                        ->findAll();
---
SELECT *
FROM `transaksi`
WHERE `id_user` = '50'
ORDER BY `tanggal_transaksi` DESC

    public function printView($id)
    {
        // Ambil transaksi
        $transaksi = $this->db->table('transaksi')->where('id', $id)->get()->getRow();

        if (!$transaksi) {
            return "Transaksi tidak ditemukan.";
        }

        // Ambil user yang melakukan transaksi
        $user = $this->db->table('users')->where('id', $transaksi->id_user)->get()->getRow();
---
SELECT *
FROM `transaksi`
WHERE `id` = '12'
SELECT *
FROM `transaksi`
WHERE `id` = '15'
SELECT *
FROM `users`
WHERE `users`.`id` = '35'