app/Models/ObatModel.php

SELECT *
FROM `obat`
WHERE `id_obat` = '6'
 LIMIT 1
---
    public function getObat($id)
    {
        return $this->where('id_obat', $id)->first();